<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"97f732aad3c5c2d267ee0c978c7c8c353fa575da9db81ba3cf0b33977b5219dc","plan_job_ref":"Job Terraform plan #39 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133064298","plan_out_hash":"6f52df76f9628f699d7fca4f2c66a921f2e58d69f914b1553305b0480829de5e","plan_hash":"712e8276eccf7ed252e2792d13b39aa9046c0c4ecfff8f095fab360811cf3d86","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
+       service_account_id = (known after apply)
        tags               = []
!~      user_hash          = "802b5ab81faee345319aa2afdef36d78314880aee7343edfb68753f093c01ab4" -> "c1410ddf089337fa5e39eeafd1c07f4fe0627fca6429c4737faa40c8863eac95"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_function_trigger.receive-video-handler-trigger will be created
+   resource "yandex_function_trigger" "receive-video-handler-trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-trigger"

+       function {
+           id = "d4ef136o48bqjg3sv4q7"
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = "***********************************************************************"
+           service_account_id = "********************"
        }
    }

  # yandex_iam_service_account.receive-video-handler-sa will be created
+   resource "yandex_iam_service_account" "receive-video-handler-sa" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-sa"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #23](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133076114)